## Staging: backoff_retry_lambda

**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`  

**⚠️ &nbsp; WARNING:** resources will be destroyed by this change!
```terraform
Plan: 6 to add, 0 to change, 3 to destroy
```

<details>
<summary>Show Plan</summary>

```terraform
aws_iam_role.backoff: Refreshing state... [id=backoff_lambda_role]
aws_iam_policy.read_write_and_encrypt_deadletter_queue: Refreshing state... [id=arn:aws:iam::005133826942:policy/CovidAlertReadWriteAndEncryptDeadletterQueue]
aws_iam_role_policy_attachment.backoff_log_writer: Refreshing state... [id=backoff_lambda_role-arn:aws:iam::005133826942:policy/CovidAlertLogWriter]
aws_iam_role_policy_attachment.backoff_read_write_and_encrypt_deadletter_queue: Refreshing state... [id=backoff_lambda_role-arn:aws:iam::005133826942:policy/CovidAlertReadWriteAndEncryptDeadletterQueue]
aws_iam_role_policy_attachment.backoff_update: Refreshing state... [id=backoff_lambda_role-arn:aws:iam::005133826942:policy/CovidAlertAggregateMetricsUpdateItem]
aws_iam_role_policy_attachment.backoff_vpc_networking: Refreshing state... [id=backoff_lambda_role-arn:aws:iam::005133826942:policy/CovidAlertVplNetworking]
aws_security_group.backoff_retry_sg: Refreshing state... [id=sg-09c44da321f64bfa7]
aws_security_group_rule.privatelink_metrics_backoff_ingress: Refreshing state... [id=sgrule-2227647019]
aws_lambda_function.backoff_retry: Refreshing state... [id=backoff_retry]
aws_cloudwatch_log_group.backoff_log_group: Refreshing state... [id=/aws/lambda/backoff_retry]
aws_lambda_event_source_mapping.dead_letters: Refreshing state... [id=1eb7192c-4708-48c3-af07-a849b8e0cbb6]
aws_cloudwatch_metric_alarm.backoff_retry_average_duration: Refreshing state... [id=save-metrics-average-duration]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_iam_policy.aggregate_metrics_update will be created
  + resource "aws_iam_policy" "aggregate_metrics_update" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "CovidAlertAggregateMetricsUpdateItem"
      + path      = "/"
      + policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "dynamodb:UpdateItem"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:dynamodb:ca-central-1:005133826942:table/aggregate_metrics"
                      + Sid      = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id = (known after apply)
      + tags_all  = (known after apply)
    }

  # aws_iam_policy.vpc_networking will be created
  + resource "aws_iam_policy" "vpc_networking" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "CovidAlertVplNetworking"
      + path      = "/"
      + policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ec2:DescribeNetworkInterfaces",
                          + "ec2:DeleteNetworkInterface",
                          + "ec2:CreateNetworkInterface",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id = (known after apply)
      + tags_all  = (known after apply)
    }

  # aws_iam_policy.write_logs will be created
  + resource "aws_iam_policy" "write_logs" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "CovidAlertLogWriter"
      + path      = "/"
      + policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:PutLogEvents",
                          + "logs:CreateLogStream",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:logs:*:*:*"
                      + Sid      = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id = (known after apply)
      + tags_all  = (known after apply)
    }

  # aws_iam_role_policy_attachment.backoff_log_writer must be replaced
-/+ resource "aws_iam_role_policy_attachment" "backoff_log_writer" {
      ~ id         = "backoff_lambda_role-arn:aws:iam::005133826942:policy/CovidAlertLogWriter" -> (known after apply)
      ~ policy_arn = "arn:aws:iam::005133826942:policy/CovidAlertLogWriter" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # aws_iam_role_policy_attachment.backoff_update must be replaced
-/+ resource "aws_iam_role_policy_attachment" "backoff_update" {
      ~ id         = "backoff_lambda_role-arn:aws:iam::005133826942:policy/CovidAlertAggregateMetricsUpdateItem" -> (known after apply)
      ~ policy_arn = "arn:aws:iam::005133826942:policy/CovidAlertAggregateMetricsUpdateItem" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # aws_iam_role_policy_attachment.backoff_vpc_networking must be replaced
-/+ resource "aws_iam_role_policy_attachment" "backoff_vpc_networking" {
      ~ id         = "backoff_lambda_role-arn:aws:iam::005133826942:policy/CovidAlertVplNetworking" -> (known after apply)
      ~ policy_arn = "arn:aws:iam::005133826942:policy/CovidAlertVplNetworking" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

Plan: 6 to add, 0 to change, 3 to destroy.

------------------------------------------------------------------------

This plan was saved to: /home/runner/work/covid-alert-metrics-terraform/covid-alert-metrics-terraform/tfplan.binary

To perform exactly these actions, run the following command to apply:
    terraform apply "/home/runner/work/covid-alert-metrics-terraform/covid-alert-metrics-terraform/tfplan.binary"

Releasing state lock. This may take a few moments...
```
</details>